import numpy as np

#1 Напишіть програму, що виводить на екран елементи лінійного масиву (елементи масиву задаються користувачем) у зворотному порядку
g = []
for i in range(10):
    g.append(i)
y = g[::-1]
print(y)

print('----------------')
#2 Напишіть програму, що виводить на екран транспоновану матрицю 3*3 (початкова матриця задається користувачем)
A = np.matrix('1 2 3; 4 5 6')
A_transpon = A.transpose()
print(A_transpon)

print('----------------')
#3 Напишіть програму, що визначає добуток двох квадратних матриць 3*3 (необхідно враховувати розмірність). Результати множення елементів занесіть до нової матриці та виведіть її на екран
matr1 = np.array([[2, 3, 1], [6, 7, 5], [8, 10, 9]])
matr2 = np.array([[11, 14, 6], [17, 15, 12], [16, 18, 19]])
matr3 = matr1 * matr2
print(matr3)

print('----------------')
#4 Напишіть програму, що у матриці 4*4 змінює всі від’ємні елементи на 0
arr = np.random.randint(-10,10, (4,4))
print(arr)
arr[(arr < 0)] *= 0
print(arr)

print('----------------')